Revit 2024 API
AnalysisDisplayLegendSettings Methods
The AnalysisDisplayLegendSettings type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Compares two legend settings objects.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace